cmsis-svd/cmsis-svd/data/NXP/LPC11Cxx.svd
					</field>
				</fields>
			</register>															
			<register>															
				<dim>3</dim>														
				<dimIncrement>0x4</dimIncrement>														
				<dimIndex>1-3</dimIndex>														
				<name>ADR%s</name>														
				<description>I2C Slave Address Register 1. Contains the 7-bit slave address for operation of the I2C interface in slave mode, and is not used in master mode. The least significant bit determines whether a slave responds to the General Call address.</description>														
				<addressOffset>0x020</addressOffset>														
				<access>read-write</access>														
				<resetValue>0x00</resetValue>														
				<resetMask>0xFFFFFFFF</resetMask>														
				<fields>														
					<field>													
						<name>GC</name>												
						<description>General Call enable bit.</description>												
						<bitRange>[0:0]</bitRange>												
					</field>													
					<field>													
						<name>Address</name>												
						<description>The I2C device address for slave mode.</description>												
						<bitRange>[7:1]</bitRange>												
					</field>													
					<field>													
						<name>RESERVED</name>												
						<description>Reserved. The value read from a reserved bit is not defined.</description>												
						<bitRange>[31:8]</bitRange>												
					</field>													
				</fields>														
			</register>															
			<register>															
				<name>DATA_BUFFER</name>														
				<description>Data buffer register. The contents of the 8 MSBs of the I2DAT shift register will be transferred to the DATA_BUFFER automatically after every nine bits (8 bits of data plus ACK or NACK) has been received on the bus.</description>														
				<addressOffset>0x02C</addressOffset>														
				<access>read-only</access>														
				<resetValue>0x00</resetValue>														
				<resetMask>0xFFFFFFFF</resetMask>														
				<fields>														
					<field>													
						<name>Data</name>												
						<description>This register holds contents of the 8 MSBs of the DAT shift register.</description>												
						<bitRange>[7:0]</bitRange>												
					</field>													
					<field>													
						<name>RESERVED</name>												
						<description>Reserved. The value read from a reserved bit is not defined.</description>												
						<bitRange>[31:8]</bitRange>												
					</field>													
				</fields>														
			</register>															
			<register>															
				<dim>4</dim>														
				<dimIncrement>0x4</dimIncrement>														
				<dimIndex>0-3</dimIndex>														
				<name>MASK%s</name>														
				<description>I2C Slave address mask register 0. This mask register is associated with I2ADR0 to determine an address match. The mask register has no effect when comparing to the General Call address (0000000).</description>														
				<addressOffset>0x030</addressOffset>														
				<access>read-write</access>														
				<resetValue>0x00</resetValue>														
				<resetMask>0xFFFFFFFF</resetMask>														
				<fields>														
					<field>													
						<name>RESERVED</name>												
						<description>Reserved. User software should not write ones to reserved bits. This bit reads always back as 0.</description>												
						<bitRange>[0:0]</bitRange>												
					</field>													
					<field>													
						<name>MASK</name>												
						<description>Mask bits.</description>												
						<bitRange>[7:1]</bitRange>												
					</field>													
					<field>													
						<name>RESERVED</name>												
						<description>Reserved. The value read from reserved bits is undefined.</description>												
						<bitRange>[31:8]</bitRange>												
					</field>													
				</fields>														
			</register>															
		</registers>		
	</peripheral>
		

  	<peripheral>
  		<name>WWDT</name>
  		<description>Product name title=UM10398 Chapter title=LPC111x/LPC11Cxx Windowed WatchDog Timer (WDT) Modification date=9/19/2011 Major revision=6 Minor revision=not available </description>
  		<groupName>WWDT</groupName>
  		<baseAddress>0x40004000</baseAddress>
  		<addressBlock>
  			<offset>0x0</offset>
  			<size>0xFFF</size>
  			<usage>registers</usage>
  		</addressBlock>
  		<interrupt>
  			<name>WDT</name>
  			<value>25</value>
  		</interrupt>
  		<registers>
  			<register>
  				<name>WDMOD</name>
  				<description>Watchdog mode register. This register contains the basic mode and status of the Watchdog Timer.</description>
  				<addressOffset>0x000</addressOffset>
  				<access>read-write</access>
  				<resetValue>0</resetValue>
  				<resetMask>0xFFFFFFFF</resetMask>
  				<fields>
  					<field>
  						<name>WDEN</name>
  						<description>Watchdog enable bit. This bit is Set Only. Setting this bit to one also locks the watchdog clock source. Once the watchdog timer is enabled, the watchdog timer clock source cannot be changed. If the watchdog timer is needed in Deep-sleep mode, the watchdog clock source must be changed to the watchdog oscillator before setting this bit to one.</description>
  						<bitRange>[0:0]</bitRange>
  						<enumeratedValues>
  							<name>ENUM</name>
  							<enumeratedValue>
  								<name>STOPPED</name>
  								<description>The watchdog timer is stopped.</description>
  								<value>0</value>
  							</enumeratedValue>
  							<enumeratedValue>
  								<name>RUN</name>
  								<description>The watchdog timer is running.</description>
  								<value>1</value>
  							</enumeratedValue>
  						</enumeratedValues>
  					</field>
  					<field>
  						<name>WDRESET</name>
  						<description>Watchdog reset enable bit. This bit is Set Only.</description>
  						<bitRange>[1:1]</bitRange>
  						<enumeratedValues>
  							<name>ENUM</name>
  							<enumeratedValue>
  								<name>NORESET</name>
  								<description>A watchdog timeout will not cause a chip reset.</description>
  								<value>0</value>
  							</enumeratedValue>
  							<enumeratedValue>
  								<name>RESET</name>
  								<description>A watchdog timeout will cause a chip reset.</description>
  								<value>1</value>
  							</enumeratedValue>
  						</enumeratedValues>
  					</field>
  					<field>
  						<name>WDTOF</name>
  						<description>Watchdog time-out flag. Set when the watchdog timer times out, by a feed error, or by events associated with WDPROTECT, cleared by software. Causes a chip reset if WDRESET = 1.</description>
  						<bitRange>[2:2]</bitRange>
  					
