cmsis-svd/cmsis-svd/data/NXP/LPC11Cxx.svd
  		</registers>
  	</peripheral>
	
  	
  	
	<peripheral>
        <name>SPI0</name>
        <description>SPI0</description>
        <groupName>SPI</groupName>
        <baseAddress>0x40040000</baseAddress>
		<addressBlock>
			<offset>0</offset>
			<size>0xFFF</size>
			<usage>registers</usage>
		</addressBlock>
		<interrupt>
			<name>SPI0</name>
			<value>20</value>
		</interrupt>
		<registers>																							
			<register>
				<name>CR0</name>
				<description>Control Register 0. Selects the serial clock rate, bus type, and data size.</description>
				<addressOffset>0x000</addressOffset>
				<access>read-write</access>
				<resetValue>0</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>DSS</name>
						<description>Data Size Select. This field controls the number of bits transferred in each frame. Values 0000-0010 are not supported and should not be used.</description>
						<bitRange>[3:0]</bitRange>
						<enumeratedValues>
							<name>ENUM</name>
							<enumeratedValue>
								<name>4_BIT_TRANSFER</name>
								<description>4-bit transfer</description>
								<value>0x3</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>5_BIT_TRANSFER</name>
								<description>5-bit transfer</description>
								<value>0x4</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>6_BIT_TRANSFER</name>
								<description>6-bit transfer</description>
								<value>0x5</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>7_BIT_TRANSFER</name>
								<description>7-bit transfer</description>
								<value>0x6</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>8_BIT_TRANSFER</name>
								<description>8-bit transfer</description>
								<value>0x7</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>9_BIT_TRANSFER</name>
								<description>9-bit transfer</description>
								<value>0x8</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>10_BIT_TRANSFER</name>
								<description>10-bit transfer</description>
								<value>0x9</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>11_BIT_TRANSFER</name>
								<description>11-bit transfer</description>
								<value>0xA</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>12_BIT_TRANSFER</name>
								<description>12-bit transfer</description>
								<value>0xB</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>13_BIT_TRANSFER</name>
								<description>13-bit transfer</description>
								<value>0xC</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>14_BIT_TRANSFER</name>
								<description>14-bit transfer</description>
								<value>0xD</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>15_BIT_TRANSFER</name>
								<description>15-bit transfer</description>
								<value>0xE</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>16_BIT_TRANSFER</name>
								<description>16-bit transfer</description>
								<value>0xF</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>FRF</name>
						<description>Frame Format.</description>
						<bitRange>[5:4]</bitRange>
						<enumeratedValues>
							<name>ENUM</name>
							<enumeratedValue>
								<name>SPI</name>
								<description>SPI</description>
								<value>0x0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>TI</name>
								<description>TI</description>
								<value>0x1</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>MICROWIRE</name>
								<description>Microwire</description>
								<value>0x2</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>RESERVED</name>
								<description>This combination is not supported and should not be used.</description>
								<value>0x3</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>CPOL</name>
						<description>Clock Out Polarity. This bit is only used in SPI mode.</description>
						<bitRange>[6:6]</bitRange>
						<enumeratedValues>
							<name>ENUM</name>
							<enumeratedValue>
								<name>LOW</name>
								<description>SPI controller maintains the bus clock low between frames.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>HIGH</name>
								<description>SPI controller maintains the bus clock high between frames.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>CPHA</name>
						<description>Clock Out Phase. This bit is only used in SPI mode.</description>
						<bitRange>[7:7]</bitRange>
						<enumeratedValues>
							<name>ENUM</name>
							<enumeratedValue>
								<name>FIRSTCLOCK</name>
								<description>SPI controller captures serial data on the first clock transition of the frame, that is, the transition away from the inter-frame state of the clock line.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>SECONDCLOCK</name>
								<description>SPI controller captures serial data on the second clock transition of the frame, that is, the transition back to the inter-frame state of the clock line.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>SCR</name>
						<description>Serial Clock Rate. The number of prescaler output clocks per bit on the bus, minus one. Given that CPSDVSR is the prescale divider, and the APB clock PCLK clocks the prescaler, the bit frequency is PCLK / (CPSDVSR X [SCR+1]).</description>
						<bitRange>[15:8]</bitRange>
						
